transitbackend/app/models/stop.rb

  def unique_stop_per_user
    existing = Stop.where(user_id: user_id)
                   .where(destination: destination)
                   .where(transit_type: transit_type)

    # Handle NULL origin values
    if origin.present?
      existing = existing.where(origin: origin)
    else
      existing = existing.where(origin: nil)
    end

    # Exclude current record if updating
    existing = existing.where.not(id: id) if persisted?

    if existing.exists?
---
SELECT 1 AS one FROM "stops" WHERE "stops"."user_id" = ? AND "stops"."destination" = ? AND "stops"."transit_type" = ? AND "stops"."origin" = ? AND "stops"."id" != ? LIMIT ?  [["user_id", 1], ["destination", "2613 S Lamar Blvd, Austin, TX 78704"], ["transit_type", "drive"], ["origin", "2215 post rd austin tx 78704"], ["id", 1], ["LIMIT", 1]]