transitbackend/app/controllers/api/v1/stops_controller.rb

      def create
        @stop = current_user.stops.build(stop_params)
        @stop.position = current_user.stops.count + 1

        if @stop.save
---
SELECT COUNT(*) FROM "stops" WHERE "stops"."user_id" = ?  [["user_id", 1]]
INSERT INTO "stops" ("user_id", "name", "destination", "transit_type", "origin", "arrival", "departure", "favorite", "position", "route_filter", "stop_filter", "ferry_direction", "location", "hidden", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

      def hide
        if @stop.update(hidden: true)
---
UPDATE "stops" SET "hidden" = ?, "updated_at" = ? WHERE "stops"."id" = ?  [["hidden", 1], ["updated_at", "2025-12-07 04:15:22.711380"], ["id", 1]]

      def destroy
        if @stop.destroy
---
DELETE FROM "stops" WHERE "stops"."id" = ?  [["id", 2]]

      def set_stop
        @stop = current_user.stops.find(params[:id])
---
SELECT "stops".* FROM "stops" WHERE "stops"."user_id" = ? AND "stops"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]